Repository: Tuurlijk/typo3-appointments
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: nl

# tx_appointments.login_error
source: You need to be logged-in with a valid user account.
nl: U dient ingelogd te zijn met een geldig gebruikersaccount.

# tx_appointments.no_agenda
source: No agenda set or found, please review plugin settings.
nl: Geen agenda ingesteld of gevonden, ga de plugin instellingen na s.v.p.

# tx_appointments.no_types
source: No appointment-types found or associated with this agenda, please review the related records.
nl: Geen afspraaktypen gevonden of geassocieerd met deze agenda, kijk s.v.p. de relevante records na.

# tx_appointments.appointment_no_longer_available
source: The appointment is no longer available. It may have been cancelled or deleted by someone after you visited the page.
nl: De afspraak is niet meer beschikbaar. Het is mogelijk geannuleerd of verwijderd door iemand nadat u de pagina bezocht.

# tx_appointments.appointment_property_deleted
source: The appointment is missing some property values. Someone might have deleted these manually after you visited the page.
nl: De afspraak mist enkele formulier gegevens. Het is mogelijk dat iemand deze handmatig heeft verwijderd nadat u de pagina bezocht.

# tx_appointments.csrf_invalid
source: Sorry, but the action you attempted was either expired or invalid.
nl: De actie die u probeert uit te voeren was niet (meer) geldig.

# tx_appointments_list.no_mutate
source: Sorry, but you don't have permission to change appointments you did not create yourself.
nl: U kunt geen afspraken wijzigen die u zelf niet heeft aangemaakt.

# tx_appointments_list.timeslot_not_allowed
source: The timeslot you picked is no longer available, possibly because you've waited too long.
nl: Het door u gekozen tijdstip is niet (meer) beschikbaar, mogelijk omdat u te lang heeft gewacht.

# tx_appointments_list.free_state
source: not reserved
nl: vrijgegeven

# tx_appointments_list.minutes_remaining
source: min remaining
nl: min resterend

# tx_appointments_list.warn_unload
source: You have not yet finished creating an appointment. Your action could result in losing all unsaved data, unless you stay on the page and - when ready - finish creating the appointment first, using the button '$1' below the form.
nl: U zit midden in het maken van een afspraak. Uw actie kan tot gevolg hebben dat alle nog niet opgeslagen gegevens verloren gaan, tenzij u op de pagina blijft en de afspraak – indien gereed – eerst definitief vast legt met de knop '$1' onderaan het formulier.

# tx_appointments_list.unfinished_header
source: Unsaved appointments
nl: Niet opgeslagen afspraken hervatten

# tx_appointments_list.unfinished_body
source: You can temporarily resume the creation of appointments, or free all timeslots used by them. Previously entered data will be kept at least as long as your browser hasn't closed.
nl: U kunt een afgebroken aanmaak-proces tijdelijk hervatten, of alle nog gebruikte tijdstippen vrijgeven. De ingevulde data wordt onthouden zolang uw browser in de tussentijd niet is afgesloten.

# tx_appointments_list.unfinished_warning
source: ATTENTION: Your browser does not fully support this functionality, or has no javascript-support. Previously entered data is not guaranteed to be restored.
nl: LET OP: Uw browser is te oud voor deze functionaliteit, of heeft geen javascript ondersteuning. Het is hierdoor niet mogelijk de volledigheid van ingevulde data te garanderen.

# tx_appointments_list.unfinished_session_incomplete
source: Previously entered data for this appointment is likely incomplete!
nl: De data van dit aanmaak-proces is mogelijk niet (meer) volledig!

# tx_appointments_list.appointment_new
source: New appointment
nl: Nieuwe afspraak

# tx_appointments_list.appointment_list
source: Back to list
nl: Terug naar lijst

# tx_appointments_list.appointment_edit
source: Edit
nl: Wijzig

# tx_appointments_list.appointment_edit_header
source: Edit appointment
nl: Wijzig afspraak

# tx_appointments_list.appointment_delete
source: Cancel
nl: Annuleer

# tx_appointments_list.appointment_delete_confirm
source: Are you sure you want to cancel this appointment?
nl: Weet u zeker dat u de afspraak wilt annuleren?

# tx_appointments_list.label_type
source: Pick type:
nl: Kies type:

# tx_appointments_list.label_date_slot
source: Pick date:
nl: Kies datum:

# tx_appointments_list.label_time_slot
source: Pick time:
nl: Kies tijd:

# tx_appointments_list.submit_next_step
source: Next step
nl: Volgende stap

# tx_appointments_list.submit_type
source: Confirm type
nl: Bevestig type

# tx_appointments_list.submit_date_slot
source: Confirm date
nl: Bevestig datum

# tx_appointments_list.submit_time_expired
source: Renew time
nl: Vernieuw tijd

# tx_appointments_list.submit_new
source: Create appointment
nl: Afspraak aanmaken

# tx_appointments_list.submit_update
source: Save appointment
nl: Afspraak opslaan

# tx_appointments_list.submit_free
source: Free timeslot
nl: Vrijgeven

# tx_appointments_list.validation_errors
source: There is a problem with some fields:
nl: Er is een probleem met de volgende velden:

# tx_appointments_list.yes
source: Yes
nl: Ja

# tx_appointments_list.no
source: No
nl: Nee

# tx_appointments_list.appointment_create_success
source: Your appointment was created.
nl: Uw afspraak is aangemaakt.

# tx_appointments_list.appointment_create_no_types
source: It is not possible to schedule an appointment on the chosen day (anymore), please pick another day.
nl: Er zijn geen (nieuwe) afspraken mogelijk op de door u gekozen datum, kies s.v.p. een andere dag.

# tx_appointments_list.crosstime_title
source: Conflicting times
nl: Tijdsconflict

# tx_appointments_list.crosstime_info
source: Your appointment could not be saved, because the times you desired would conflict with other appointments. %s
nl: Uw afspraak kan niet opgeslagen worden, omdat de de door u gewenste tijden in conflict zijn met andere afspraken. %s

# tx_appointments_list.crosstime_begin
source: - Begintime (%s) has a %d-minute overlap with an earlier appointment
nl: - Begintijd (%s) heeft een %d-minuten overlap met een eerdere afspraak

# tx_appointments_list.crosstime_end
source: - Endtime (%s) has a %d-minute overlap with a later appointment
nl: - Eindtijd (%s) heeft een %d-minuten overlap met een latere afspraak

# tx_appointments_list.appointment_timerstart
source: Your chosen timeslot is now reserved temporarily by you. The timeslot is unavailable for $1 minutes, so that you can fill out the form and schedule the appointment for the chosen time. If you did not finish creating the appointment before the timer runs out, then the timeslot will be made available again for you or someone else.
nl: Het gekozen tijdstip is door u tijdelijk gereserveerd. Het tijdstip wordt $1 minuten bezet gehouden, zodat u binnen die tijd het formulier kunt invullen en de afspraak definitief kunt maken. Is het vastleggen van de afspraak niet voor het aflopen van de timer afgerond, dan wordt het tijdstip vrijgegeven en kan door u of iemand anders in gebruik genomen worden.

# tx_appointments_list.appointment_timer_header
source: Timeslot is reserved temporarily by you.
nl: Tijdstip is tijdelijk door u gereserveerd.

# tx_appointments_list.appointment_timer
source: Will automatically be available again after: $1
nl: Wordt automatisch vrijgegeven na: $1

# tx_appointments_list.appointment_timerrefresh
source: Your last chosen timeslot was still available for you. It has been reserved by you again.
nl: Het laatste door u gekozen tijdstip was nog steeds beschikbaar voor u. Het tijdstip is opnieuw door u gereserveerd.

# tx_appointments_list.appointment_expired_header
source: Timeslot no longer reserved.
nl: Tijdstip vrijgegeven.

# tx_appointments_list.appointment_expired
source: Please renew your timeslot-choice before someone else reserves it.
nl: Vernieuw uw tijdstip-keuze voordat iemand anders het in gebruik neemt.

# tx_appointments_list.appointment_update_success
source: Your appointment was updated.
nl: Uw afspraak is opgeslagen.

# tx_appointments_list.appointment_update_crosstime
source: The appointment could not be saved, because your desired time-changes would result in an overlap of appointments. Please pick another timeslot or try again later.
nl: De afspraak kon niet opgeslagen worden, omdat de door u gewenste tijdswijziging in conflict is met tijden van andere afspraken. Probeer een ander tijdstip/tijdsduur of probeer het later opnieuw.

# tx_appointments_list.appointment_delete_success
source: Your appointment was cancelled.
nl: Uw afspraak is geannuleerd.

# tx_appointments_list.appointment_free_success
source: The timeslot has been freed, you'll have to reserve a date/timeslot again before you can fill out the form any further to schedule the appointment.
nl: Het tijdstip is vrijgegeven, u dient opnieuw een datum/tijdstip te kiezen voordat u het formulier verder kunt invullen om de afspraak aan te maken.

# tx_appointments_list.required
source: required field
nl: vereist veld

# tx_appointments_list.email_create_subject
source: Appointment confirmation
nl: Bevestiging afspraak

# tx_appointments_list.email_update_subject
source: Appointment change
nl: Wijziging afspraak

# tx_appointments_list.email_delete_subject
source: Appointment cancellation
nl: Annulering afspraak

# tx_appointments_list.calendar_create_subject
source: Appointment confirmation
nl: Bevestiging afspraak

# tx_appointments_list.calendar_update_subject
source: Appointment change
nl: Wijziging afspraak

# tx_appointments_list.calendar_delete_subject
source: Appointment cancellation
nl: Annulering afspraak

# tx_appointments_list.email_link_label
source: View appointment
nl: Bekijk afspraak

# tx_appointments_list.email_error
source: Notification by email failed because of an error. Please notify the site-administrator!
nl: Berichtgeving middels e-mail is mislukt vanwege een fout. Het is misschien verstandig de website-beheerder hiervan op de hoogte te brengen!

# tx_appointments_list.csh
source: Help
nl: Toelichting

# error.appointment.formFieldValues.value.4075013371337
source: This field adds to the appointment-duration. Please review if changing it is an option to resolve the time-conflict.
nl: Dit veld draagt bij aan de afspraakduur. Mogelijk lost u het tijdsconflict op als u een verandering in dit veld doorvoert.

# error.appointment.beginTime.4075013371337
source: If you have no other option, you might have to renew the appointment with another timeslot.
nl: Als u geen andere opties heeft, kunt het tijdsconflict verhelpen door de afspraak met een ander tijdstip te vernieuwen.

# error.appointment.beginTime.407501337
source: Please choose a different date/time.
nl: Kies opnieuw een datum/tijdstip s.v.p.

# error.appointment.address.firstName.1221560718
source: Should not be empty.
nl: Mag niet leeg zijn.

# error.appointment.address.lastName.1221560718
source: Should not be empty.
nl: Mag niet leeg zijn.

# error.appointment.address.birthday.1238087674
source: Should be a valid date in 'dd-mm-yyyy' format, e.g. 24-12-1951
nl: Dient een geldige datum van het formaat 'dd-mm-jjjj' te zijn, bijv. 24-12-1951

# error.appointment.address.birthday.1307719788
source: Should be a valid date in 'dd-mm-yyyy' format, e.g. 24-12-1951
nl: Dient een geldige datum van het formaat 'dd-mm-jjjj' te zijn, bijv. 24-12-1951

# error.appointment.address.address.1221560718
source: Should not be empty.
nl: Mag niet leeg zijn.

# error.appointment.address.zip.1221565130
source: Should be a valid zip code, e.g. 1000AD
nl: Dient een geldige postcode te zijn, bijv. 1000AD

# error.appointment.address.city.1221560718
source: Should not be empty.
nl: Mag niet leeg zijn.

# error.appointment.formFieldValues.value.1221560494
source: Should be a (whole) number.
nl: Dient een (heel) getal te zijn.

# error.appointment.formFieldValues.value.1221560718
source: Should not be empty.
nl: Mag niet leeg zijn.

# error.appointment.formFieldValues.value.1221560910
source: Please make a choice.
nl: Maak een keuze s.v.p.

# error.appointment.formFieldValues.value.1238087674
source: Should be a valid date in 'dd-mm-yyyy' format, e.g. 24-12-1951
nl: Dient een geldige datum van het formaat 'dd-mm-jjjj' te zijn, bijv. 24-12-1951

# error.appointment.formFieldValues.value.1307719788
source: Should be a valid date in 'dd-mm-yyyy' format, e.g. 24-12-1951
nl: Dient een geldige datum van het formaat 'dd-mm-jjjj' te zijn, bijv. 24-12-1951

# error.appointment.formFieldValues.value.1221559976
source: Should be a valid email address.
nl: Dient een geldig email-adres te zijn.

# error.appointment.formFieldValues.value.1221560288
source: Should be a divisional.
nl: Dient een getal met breuk te zijn.

# error.appointment.formFieldValues.value.1221563685
source: Should be a number.
nl: Dient een nummer te zijn.

# error.appointment.formFieldValues.value.1221561046
source: Should be a (whole) number of 0 or higher.
nl: Dient een (heel) getal van 0 of hoger te zijn.

# tx_appointments_list.day_s1
source: Mo
nl: Ma

# tx_appointments_list.day_s2
source: Tu
nl: Di

# tx_appointments_list.day_s3
source: We
nl: Wo

# tx_appointments_list.day_s4
source: Th
nl: Do

# tx_appointments_list.day_s5
source: Fr
nl: Vr

# tx_appointments_list.day_s6
source: Sa
nl: Za

# tx_appointments_list.day_s7
source: Su
nl: Zo

# tx_appointments_agenda.day_1
source: Monday
nl: Maandag

# tx_appointments_agenda.day_2
source: Tuesday
nl: Dinsdag

# tx_appointments_agenda.day_3
source: Wednesday
nl: Woensdag

# tx_appointments_agenda.day_4
source: Thursday
nl: Donderdag

# tx_appointments_agenda.day_5
source: Friday
nl: Vrijdag

# tx_appointments_agenda.day_6
source: Saturday
nl: Zaterdag

# tx_appointments_agenda.day_7
source: Sunday
nl: Zondag

# tx_appointments_agenda.month_1
source: January
nl: Januari

# tx_appointments_agenda.month_2
source: February
nl: Februari

# tx_appointments_agenda.month_3
source: March
nl: Maart

# tx_appointments_agenda.month_5
source: May
nl: Mei

# tx_appointments_agenda.month_6
source: June
nl: Juni

# tx_appointments_agenda.month_7
source: July
nl: Juli

# tx_appointments_agenda.month_8
source: August
nl: Augustus

# tx_appointments_agenda.month_10
source: October
nl: Oktober

# tx_appointments_agenda.month_s3
source: Mar
nl: Maa

# tx_appointments_agenda.month_s5
source: May
nl: Mei

# tx_appointments_agenda.month_s10
source: Oct
nl: Okt

# tx_appointments_agenda.weeks_back
source: Previous weeks
nl: Vorige weken

# tx_appointments_agenda.weeks_forward
source: Next weeks
nl: Volgende weken

# tx_appointments_agenda.caption_month
source: Agenda month overview
nl: Agenda maand overzicht

# tx_appointments_agenda.summary_month
source: This is the agenda month overview. It displays appointments of all users. You can navigate between months (if enabled) and you can view appointments by clicking on them.
nl: Dit is een agenda maand overzicht. Het toont de afspraken van alle gebruikers. U kunt andere maanden tonen (indien geactiveerd) en u kunt de details van afspraken inzien door op ze te klikken.

# tx_appointments_agenda.caption_weeks
source: Agenda weeks overview
nl: Agenda weken overzicht

# tx_appointments_agenda.summary_weeks
source: This is the agenda weeks overview. It displays appointments of all users. You can navigate between weeks (if enabled) and you can view appointments by clicking on them.
nl: Dit is een agenda weken overzicht. Het toont de afspraken van alle gebruikers. U kunt andere weken tonen (indien geactiveerd) en u kunt de details van afspraken inzien door op ze te klikken.

# tx_appointments_list.caption_list
source: Your appointments
nl: Uw afspraken

# tx_appointments_list.summary_list
source: This is a listing of future/current appointments that belong to you.
nl: Dit is een lijst van toekomstige/huidige afspraken die aan u toebehoren.

# tx_appointments_list.caption_show
source: Appointment details
nl: Afspraak details

# tx_appointments_list.summary_show
source: This is a listing of details of the the appointment you've chosen to view.
nl: Dit is een lijst van details van de afspraak die u gekozen heeft.

# property.appointment
source: Appointment
nl: Afspraak

# property.appointment.type
source: Appointment type
nl: Afspraak type

# property.appointment.type.cshNew1
source: Here you may choose the appointment type. Each appointment type may differ. If you have picked a date first, the currently available choices are limited to what types are (still) possible on the chosen date.
nl: Hier kiest u wat voor type afspraak u wilt. Elk afspraak type verschilt en heeft daarmee mogelijk ook een andere invulling. Als u eerst een datum had gekozen, dan zijn de huidig beschikbare keuzes beperkt tot de mogelijkheden op de gekozen datum.

# property.appointment.type.cshNew2
source: You may still change the appointment type for the chosen timeslot. Please note: the currently available choices are limited to what types (still) have the chosen timeslot available. If your desired appointment type is missing, then it's not available for the chosen timeslot and you'll have to change the timeslot first.
nl: U kunt nu nog het afspraak type wijzigen voor het gekozen tijdstip. Let op: de huidige beschikbare keuzes zijn beperkt tot de mogelijkheden op het gekozen tijdstip. Als het door u gewenste afspraak type ontbreekt, dan is het niet beschikbaar op de door u gekozen tijdstip en zult u eerst het tijdstip moeten wijzigen.

# property.appointment.type.cshEdit
source: The appointment type cannot be changed for any already scheduled appointment. If you wish to create a different appointment type, you will need to schedule a new appointment for that instead.
nl: Het afspraak type. Het afspraak type kunt u niet meer wijzigen bij een al ingeplande afspraak. Mocht u alsnog een andere afspraak type willen, dan zult u daarvoor een nieuwe afspraak moeten inplannen.

# property.appointment.beginTime
source: Date/Time
nl: Datum/Tijd

# property.appointment.beginTime.date
source: Appointment date
nl: Datum afspraak

# property.appointment.beginTime.date.cshNew1
source: The date of the appointment. The available choices consist of all dates that (still) have timeslots available, for this particular appointment type. Different appointment types may result in different available dates.
nl: De datum van de afspraak. De beschikbare keuzes bestaan uit alle dagen met (nog) beschikbare tijden, voor het specifieke afspraak type. Een andere afspraak type kan andere beschikbare dagen tot gevolg hebben.

# property.appointment.beginTime.date.cshNew2
source: To change the date, you'll have to free up the currently chosen timeslot first.
nl: Als u de datum wilt wijzigen, dient u eerst het gekozen tijdstip vrij te geven.

# property.appointment.beginTime.time
source: Time of appointment
nl: Tijd afspraak

# property.appointment.beginTime.time.cshNew1
source: The time of the appointment. The available choices consist of all (still) available timeslots on the picked date, for this particular appointment type. Different dates and/or appointment types may result in different available timeslots.
nl: De tijd van de afspraak. De beschikbare keuzes bestaan uit alle (nog) beschikbare tijden op de gekozen datum, voor het specifieke afspraak type. Een andere datum en/of afspraak type kan andere beschikbare tijden tot gevolg hebben.

# property.appointment.beginTime.time.cshNew2
source: To change the timeslot, you'll have to free up the currently chosen timeslot first.
nl: Als u het tijdstip wilt wijzigen, dient u eerst het gekozen tijdstip vrij te geven.

# property.appointment.beginReserved
source: Agenda reserved
nl: Gereserveerd

# property.appointment.specialFields
source: Notes
nl: Notities

# property.appointment.notes
source: Notes
nl: Opmerkingen

# property.appointment.notes.csh
source: You may set (private) notes here, relevant to the appointment.
nl: U kunt hier (privé) opmerkingen kwijt die relevant zijn voor de afspraak.

# property.appointment.notesSu
source: Administrator notes
nl: Opmerkingen van beheerder

# property.appointment.notesSu.csh
source: You may set administrator notes here that are only viewable by administrators.
nl: U kunt hier opmerkingen kwijt die alleen in te zien zijn door beheerders.

# property.appointment.formFieldValues
source: Additional information
nl: Aanvullende informatie

# property.appointment.address
source: Name and address information
nl: NAW gegevens

# property.appointment.feUser
source: Created by
nl: Aangemaakt door

# property.appointment.address.name
source: Name
nl: Naam

# property.appointment.address.firstName
source: First name
nl: Voornaam

# property.appointment.address.middleName
source: Middle name
nl: Tussenvoegsel

# property.appointment.address.lastName
source: Last name
nl: Achternaam

# property.appointment.address.gender
source: Gender
nl: Geslacht

# property.appointment.address.gender.m
source: Male
nl: Man

# property.appointment.address.gender.f
source: Female
nl: Vrouw

# property.appointment.address.birthday
source: Birthdate
nl: Geboortedatum

# property.appointment.address.birthday.placeholder
source: dd-mm-yyyy
nl: dd-mm-jjjj

# property.appointment.address.address
source: Address
nl: Adres

# property.appointment.address.zip
source: Zip code
nl: Postcode

# property.appointment.address.city
source: City
nl: Woonplaats

# property.appointment.address.socialSecurityNumber
source: Social Security Number
nl: BSN

# property.appointment.address.email
source: Emailaddress
nl: E-mailadres

# tx_appointments_domain_model_agenda_month.month_back
source: Previous month
nl: Vorige maand

# tx_appointments_domain_model_agenda_month.month_forward
source: Next month
nl: Volgende maand

# tx_appointments_domain_model_agenda_date.is_holiday
source: Holiday
nl: Feestdag

# link.title.appointment_show
source: View appointment details
nl: Bekijk afspraak details

# link.title.appointment_new
source: Create appointment
nl: Maak nieuwe afspraak

# link.title.appointment_edit
source: Edit appointment
nl: Wijzig afspraak

# link.title.appointment_resume
source: Resume appointment creation
nl: Resumeer afspraak aanmaken

# link.title.previous
source: View previous
nl: Bekijk vorige

# link.title.next
source: View next
nl: Bekijk volgende

# link.title.back
source: Go back
nl: Ga terug

# tx_appointments_plugin_agenda_title
source: Appointment Scheduler: Show Agenda
nl: Afspraken Planner: Toon Agenda

# tx_appointments_plugin_list_title
source: Appointment Scheduler: Appointment List
nl: Afspraken Planner: Afspraken Lijst

# tx_appointments_subcategory_extconf
source: Extension Configuration
nl: Extensie Configuratie

# tx_appointments_subcategory_plugins
source: All Plugins (Flexform)
nl: Plugins Algemeen (Flexform)

# tx_appointments_constants_templateRootPath
source: Path to template root (FE)
nl: Pad naar template root (FE)

# tx_appointments_constants_partialRootPath
source: Path to template partials (FE)
nl: Pad naar template partials (FE)

# tx_appointments_constants_layoutRootPath
source: Path to template layouts (FE)
nl: Pad naar template layouts (FE)

# tx_appointments_constants_storagePid
source: Default storage PID
nl: Standaard Opslag PID

# tx_appointments_constants_allowCreate
source: Agenda New Appointment Buttons: If enabled, adds new appointment buttons to the agenda view
nl: Agenda Nieuwe Afspraak Knoppen: Voegt nieuwe afspraak knoppen toe aan de agenda weergave

# tx_appointments_constants_agendaBack
source: Agenda Navigation Back: The number of navigation units to allow backwards from the initial display
nl: Agenda Navigatie Terug: De hoeveelheid navigatie eenheden terug waarnaar genavigeerd kan worden

# tx_appointments_constants_agendaForward
source: Agenda Navigation Forward: The number of navigation units to allow forward from the initial display
nl: Agenda Navigatie Vooruit: De hoeveelheid navigatie eenheden vooruit waarnaar genavigeerd kan worden
