Repository: Tuurlijk/typo3-appointments
Catalog: Resources/Private/Language/*.locallang_csh_tx_appointments_domain_model_appointment.xlf
Languages: nl

# creation_progress.description
source: Indicates this appointment is still in the process of being made, with the possibility of disappearing if not finalized
nl: Geeft aan dat de afspraak midden in het aanmaak-proces zit, met de mogelijkheid dat deze verdwijnt als hij niet definitief wordt opgeslagen

# begin_time.description
source: Starting time of appointment
nl: Begintijd van afspraak

# end_time.description
source: Ending time of appointment
nl: Eindtijd van afspraak

# begin_reserved.description
source: Starting time of the reservation block
nl: Starttijd van het gereserveerde tijdsblok

# end_reserved.description
source: Ending time of the reservation block
nl: Eindtijd van het gereserveerde tijdsblok

# notes.description
source: Notes
nl: Opmerkingen

# notes_su.description
source: Administrator Notes
nl: Opmerkingen van beheerders

# type.description
source: Appointment Type which this Appointment belongs to
nl: Afspraken Type van deze afspraak

# form_field_values.description
source: Form field values associated with this appointment
nl: Formulier veld waarden gerelateerd aan deze afspraak

# address.description
source: Name and address information
nl: NAW gegevens

# fe_user.description
source: User who created this appointment or is assigned to it
nl: De gebruiker die de afspraak heeft aangemaakt of krijgt toegewezen

# agenda.description
source: Agenda in which this appointment is made
nl: Agenda waaraan de afspraak wordt toegevoegd
