Repository: Tuurlijk/typo3-appointments
Catalog: Resources/Private/Language/*.locallang_csh_tx_appointments_domain_model_formfield.xlf
Languages: nl

# title.description
source: Internal field title
nl: Interne veld titel

# label.description
source: Field label as shown on Frontend
nl: Veld label zoals getoond op Frontend

# csh.description
source: Helptext shown on Frontend next to the field
nl: Toelichting dat op de Frontend naast het veld wordt getoond

# validation_types.description
source: Validation types can force the field to be validated as the chosen types of content. If the field content does not match the validation type, the form will inform the user and not save until corrected.
nl: Validatie types forceren een veld om zich te valideren als het gekozen type inhoud. Als een veld niet voldoet aan een validatie type, dan zal het formulier dit aangeven en niet opgeslagen worden voor dit gecorrigeerd is.

# field_type.description
source: The field type determines its appearance and input method
nl: Het veld type bepaalt zijn uiterlijk en invoerwijze

# choices.description
source: Selection choices, one per line. You may define values that differ from their labels, if desired. See details for the different approaches.
nl: Selectie keuzes, per regel één. U kunt de waarden en labels van elkaar laten verschillen, indien gewenst. Zie details voor de verschillende methoden.

# choices.details
source: The choices represent value/label combinations for your chosen type of field. You may explicitly define values and labels, separated by a pipe character: | value1|label1 value2|label2 If the label and value are the same, you can explicitly define both like above, or omit either one: choice1|choice1 choice2 If you want to have a decorative or informative label that doesn't represent an actual value, you may provide an empty value: |Make a choice: yes no If the last example is combined with a "Not Empty" Validation Type, the user becomes required to choose either yes or no before he is able to save the appointment, because the first label shown has an empty value.
nl: De keuzes vertegenwoordigen waarde/label combinaties voor een selectie. U kunt expliciet een waarde en een label opgeven per keuze, gescheiden met een pipe: | waarde1|label1 waarde2|label2 Als de label en de waarde gelijk moeten zijn, kunt u zoals in het voorbeeld hierboven ze beiden expliciet noemen, of één van beiden weglaten: keuze1|keuze1 keuze2 Als u een decoratieve of informatieve label wilt die niet echt een daadwerkelijke waarde vertegenwoordigd, kunt u een lege waarde gebruiken: |Maak een keuze: ja nee Als het laatste voorbeeld gecombineerd is met een "Vereist" Validatie Type, dan is de gebruiker vereist om de ja of nee keuze te selecteren alvorens hij de afspraak kan opslaan, omdat de eerste label een lege waarde heeft.

# function.description
source: The function sets whether the field has a special meaning. See details for the different choices.
nl: De functie bepaalt of het veld een speciale betekenis heeft. Zie details voor verdere toelichting en aanbevelingen.

# function.details
source: The field can have functionality in addition to being of informative use. If you choose to let it add time, its value will be interpreted as a number that will add to the appointment duration. If chosen, it is highly recommended to add the <strong>Natural Number</strong> Validation Type! If you choose Email confirmation, its value will be interpreted as an email address to which confirmations could be sent, according to agenda configuration. (if disabled in agenda, the field will remain informative) The <strong>Email Address</strong> Validation Type is recommended for this choice!
nl: Een veld kan voorzien worden van extra functionaliteit, buiten zijn aanvankelijk informatieve waarde. Indien de keuze valt op het toevoegen van tijd, dan wordt invoer van dit veld geïnterpreteerd als een getal dat bij de tijdsduur van de afspraak wordt opgeteld. Het wordt daarom sterk aanbevolen deze keuze met het <strong>Natuurlijk Getal</strong> Validatie Type te combineren! In geval van E-mail bevestiging wordt invulling van het veld geïnterpreteerd als een e-mail adres waarnaar bevestigingen gestuurd kunnen worden (mits ingesteld in de agenda!). Het wordt daarom sterk aanbevolen deze keuze met het <strong>E-mail Adres</strong> Validatie te combineren!

# enable_field.description
source: The condition-field that enables the current field if the given value matches
nl: Het conditie-veld dat bij de opgegeven waarde het huidige veld activeert

# enable_value.description
source: The condition-value is case-insensitive
nl: De conditie-waarde is hoofdletterongevoelig
