Repository: Tuurlijk/typo3-appointments
Catalog: Resources/Private/Language/*.locallang_db.xlf
Languages: nl

# tx_appointments_domain_model_appointment
source: Appointment
nl: Afspraak

# tx_appointments_domain_model_appointment.creation_progress
source: Creation Progress
nl: Vordering Aanmaak

# tx_appointments_domain_model_appointment.begin_time
source: Appointment Time
nl: Begintijd

# tx_appointments_domain_model_appointment.end_time
source: End Time
nl: Eindtijd

# tx_appointments_domain_model_appointment.begin_reserved
source: Start Reservation Time
nl: Start Reserveringstijd

# tx_appointments_domain_model_appointment.end_reserved
source: End Reservation Time
nl: Einde Reserveringstijd

# tx_appointments_domain_model_appointment.notes
source: Notes
nl: Opmerkingen

# tx_appointments_domain_model_appointment.notes_su
source: Administrator Notes
nl: Opmerkingen Beheerder

# tx_appointments_domain_model_appointment.type
source: Appointment Type
nl: Afspraak Type

# tx_appointments_domain_model_appointment.form_field_values
source: Form Field Values
nl: Formulier Veld Waardes

# tx_appointments_domain_model_appointment.address
source: Address
nl: Adresgegevens

# tx_appointments_domain_model_appointment.fe_user
source: User
nl: Gebruiker

# tx_appointments_domain_model_appointment.palette.times
source: Times
nl: Tijden

# tx_appointments_domain_model_agenda.name
source: Name
nl: Naam

# tx_appointments_domain_model_agenda.holidays
source: Holidays
nl: Feestdagen

# tx_appointments_domain_model_agenda.types
source: Appointment Types
nl: Afspraak Typen

# tx_appointments_domain_model_agenda.email_address
source: Email Address
nl: E-mail Adres

# tx_appointments_domain_model_agenda.email_text
source: Email Body Text
nl: E-mail Tekst

# tx_appointments_domain_model_agenda.calendar_invite_address
source: Calendar Invite Address
nl: Kalender Uitnodiging Adres

# tx_appointments_domain_model_agenda.calendar_invite_text
source: Calendar Invite Description
nl: Kalender Uitnodiging Omschrijving

# tx_appointments_domain_model_agenda.email_owner_types
source: To User On:
nl: Naar Gebruiker Bij:

# tx_appointments_domain_model_agenda.email_field_types
source: To User-Provided Addresses On:
nl: Naar Door Gebruiker-Opgegeven Adressen Bij:

# tx_appointments_domain_model_agenda.email_types
source: To Configured Addresses On:
nl: Naar Ingestelde Adressen Bij:

# tx_appointments_domain_model_agenda.calendar_invite_types
source: Send Calendar Invitation/Update On:
nl: Stuur Kalender Uitnodiging/Wijziging Bij:

# tx_appointments_domain_model_agenda.types.create
source: created appointments
nl: aangemaakte afspraken

# tx_appointments_domain_model_agenda.types.update
source: updated appointments
nl: gewijzigde afspraken

# tx_appointments_domain_model_agenda.types.delete
source: cancelled appointments
nl: geannuleerde afspraken

# tx_appointments_domain_model_agenda.div.email
source: Email Settings
nl: E-mail Instellingen

# tx_appointments_domain_model_agenda.div.calendar_invite
source: Calendar Invite Settings
nl: Kalender Uitnodiging Instellingen

# tx_appointments_domain_model_agenda.palette.email_types
source: Send Confirmation Email ..
nl: Stuur Bevestigingsmail ..

# tx_appointments_domain_model_type
source: Appointment Type
nl: Afspraak Type

# tx_appointments_domain_model_type.name
source: Name
nl: Naam

# tx_appointments_domain_model_type.exclusive_availability
source: Exclusive Availability
nl: Exclusieve Beschikbaarheid

# tx_appointments_domain_model_type.dont_block_types
source: Don't Block Other Types
nl: Blokkeer Geen Andere Types

# tx_appointments_domain_model_type.dont_restrict_type_counts
source: Don't Restrict Other Type Counts
nl: Beperk Geen Andere Types In Aantal

# tx_appointments_domain_model_type.default_duration
source: Appointment Duration
nl: Duur Afspraak

# tx_appointments_domain_model_type.start_time
source: Start Time
nl: Start Tijd

# tx_appointments_domain_model_type.start_time_monday
source: Start Time Monday
nl: Start Tijd Maandag

# tx_appointments_domain_model_type.start_time_tuesday
source: Start Time Tuesday
nl: Start Tijd Dinsdag

# tx_appointments_domain_model_type.start_time_wednesday
source: Start Time Wednesday
nl: Start Tijd Woensdag

# tx_appointments_domain_model_type.start_time_thursday
source: Start Time Thursday
nl: Start Tijd Donderdag

# tx_appointments_domain_model_type.start_time_friday
source: Start Time Friday
nl: Start Tijd Vrijdag

# tx_appointments_domain_model_type.start_time_saturday
source: Start Time Saturday
nl: Start Tijd Zaterdag

# tx_appointments_domain_model_type.start_time_sunday
source: Start Time Sunday
nl: Start Tijd Zondag

# tx_appointments_domain_model_type.stop_time
source: Stop Time
nl: Stop Tijd

# tx_appointments_domain_model_type.stop_time_monday
source: Stop Time Monday
nl: Stop Tijd Maandag

# tx_appointments_domain_model_type.stop_time_tuesday
source: Stop Time Tuesday
nl: Stop Tijd Dinsdag

# tx_appointments_domain_model_type.stop_time_wednesday
source: Stop Time Wednesday
nl: Stop Tijd Woensdag

# tx_appointments_domain_model_type.stop_time_thursday
source: Stop Time Thursday
nl: Stop Tijd Donderdag

# tx_appointments_domain_model_type.stop_time_friday
source: Stop Time Friday
nl: Stop Tijd Vrijdag

# tx_appointments_domain_model_type.stop_time_saturday
source: Stop Time Saturday
nl: Stop Tijd Zaterdag

# tx_appointments_domain_model_type.stop_time_sunday
source: Stop Time Sunday
nl: Stop Tijd Zondag

# tx_appointments_domain_model_type.exclude_holidays
source: Don't Allow Holidays
nl: Niet Toestaan Op Feestdagen

# tx_appointments_domain_model_type.max_amount
source: Allowed Appointments
nl: Toegestane Afspraken

# tx_appointments_domain_model_type.max_amount_monday
source: Allowed Appointments Monday
nl: Toegestane Afspraken Maandag

# tx_appointments_domain_model_type.max_amount_tuesday
source: Allowed Appointments Tuesday
nl: Toegestane Afspraken Dinsdag

# tx_appointments_domain_model_type.max_amount_wednesday
source: Allowed Appointments Wednesday
nl: Toegestane Afspraken Woensdag

# tx_appointments_domain_model_type.max_amount_thursday
source: Allowed Appointments Thursday
nl: Toegestane Afspraken Donderdag

# tx_appointments_domain_model_type.max_amount_friday
source: Allowed Appointments Friday
nl: Toegestane Afspraken Vrijdag

# tx_appointments_domain_model_type.max_amount_saturday
source: Allowed Appointments Saturday
nl: Toegestane Afspraken Zaterdag

# tx_appointments_domain_model_type.max_amount_sunday
source: Allowed Appointments Sunday
nl: Toegestane Afspraken Zondag

# tx_appointments_domain_model_type.minute_interval
source: Appointment Interval
nl: Afspraak Interval

# tx_appointments_domain_model_type.minute_interval_monday
source: Appointment Interval Monday
nl: Afspraak Interval Maandag

# tx_appointments_domain_model_type.minute_interval_tuesday
source: Appointment Interval Tuesday
nl: Afspraak Interval Dinsdag

# tx_appointments_domain_model_type.minute_interval_wednesday
source: Appointment Interval Wednesday
nl: Afspraak Interval Woensdag

# tx_appointments_domain_model_type.minute_interval_thursday
source: Appointment Interval Thursday
nl: Afspraak Interval Donderdag

# tx_appointments_domain_model_type.minute_interval_friday
source: Appointment Interval Friday
nl: Afspraak Interval Vrijdag

# tx_appointments_domain_model_type.minute_interval_saturday
source: Appointment Interval Saturday
nl: Afspraak Interval Zaterdag

# tx_appointments_domain_model_type.minute_interval_sunday
source: Appointment Interval Sunday
nl: Afspraak Interval Zondag

# tx_appointments_domain_model_type.max_amount_per_var_days
source: Allowed Appointments
nl: Toegestane Afspraken

# tx_appointments_domain_model_type.per_var_days
source: Per .. Days
nl: Per .. Dagen

# tx_appointments_domain_model_type.between_minutes
source: Reserved Time Block
nl: Reservering Tijdsblok

# tx_appointments_domain_model_type.hours_mutable
source: Mutable Hours
nl: Uren Te Wijzigen

# tx_appointments_domain_model_type.blocked_hours
source: Hours Before First Timeslot
nl: Uren Voor Eerste Tijdsslot

# tx_appointments_domain_model_type.blocked_hours_workdays
source: Workday Hours Before First Timeslot
nl: Werkdag Uren Voor Eerste Tijdsslot

# tx_appointments_domain_model_type.max_days_forward
source: Days Available
nl: Dagen Beschikbaar

# tx_appointments_domain_model_type.form_fields
source: Additional Form Fields
nl: Aanvullende Formulier Velden

# tx_appointments_domain_model_type.address_disable
source: Disable All
nl: Alles Uitschakelen

# tx_appointments_domain_model_type.palette.overrule
source: Overrule
nl: Regels Met Voorrang

# tx_appointments_domain_model_type.div.day_config
source: Per Day Configuration
nl: Per Dag Configuratie

# tx_appointments_domain_model_type.div.address_fields
source: Name/Address Form Fields
nl: NAW Formulier Velden

# tx_appointments_domain_model_formfield
source: Form Field
nl: Formulier Veld

# tx_appointments_domain_model_formfield.title
source: Title
nl: Titel

# tx_appointments_domain_model_formfield.csh
source: Helptext
nl: Toelichtingstekst

# tx_appointments_domain_model_formfield.validation_types
source: Validation Types
nl: Validatie Types

# tx_appointments_domain_model_formfield.validation_types.alphanum
source: Alphanumeric
nl: Alphanumeriek

# tx_appointments_domain_model_formfield.validation_types.datetime
source: Date
nl: Datum

# tx_appointments_domain_model_formfield.validation_types.email
source: Email Address
nl: E-mail Adres

# tx_appointments_domain_model_formfield.validation_types.float
source: Float
nl: Breuk

# tx_appointments_domain_model_formfield.validation_types.integer
source: Integer
nl: Heel Getal

# tx_appointments_domain_model_formfield.validation_types.notempty
source: Not Empty
nl: Vereist

# tx_appointments_domain_model_formfield.validation_types.number
source: Number
nl: Nummer

# tx_appointments_domain_model_formfield.validation_types.string
source: String
nl: Tekenreeks

# tx_appointments_domain_model_formfield.validation_types.text
source: Text
nl: Tekst

# tx_appointments_domain_model_formfield.validation_types.naturalnumber
source: Natural Number
nl: Natuurlijk Getal

# tx_appointments_domain_model_formfield.field_type
source: Field Type
nl: Veld Type

# tx_appointments_domain_model_formfield.field_type.boolean
source: Checkbox
nl: Vinkje

# tx_appointments_domain_model_formfield.field_type.radio
source: Radio Button
nl: Keuzerondje

# tx_appointments_domain_model_formfield.field_type.select
source: Selection Box
nl: Selectie

# tx_appointments_domain_model_formfield.field_type.textsmall
source: Small Textfield
nl: Klein Tekstveld

# tx_appointments_domain_model_formfield.field_type.textlarge
source: Large Textarea
nl: Groot Tekstveld

# tx_appointments_domain_model_formfield.choices
source: Choices
nl: Keuzes

# tx_appointments_domain_model_formfield.function
source: Function
nl: Functie

# tx_appointments_domain_model_formfield.function.info
source: Informational
nl: Informatief

# tx_appointments_domain_model_formfield.function.addtime
source: Adds user-specified minutes
nl: Telt minuten bij afspraak op

# tx_appointments_domain_model_formfield.function.email
source: Email confirmation
nl: E-mail bevestiging

# tx_appointments_domain_model_formfield.enable_field
source: Condition Field
nl: Conditie Veld

# tx_appointments_domain_model_formfield.enable_field.default
source: Always Enabled
nl: Altijd geactiveerd

# tx_appointments_domain_model_formfield.enable_value
source: Enable On Value
nl: Conditie Waarde

# tx_appointments_domain_model_formfield.palette.enable_field
source: Conditions Enabling Field
nl: Condities Veld Activatie

# tx_appointments_domain_model_formfield.div.enable_field
source: Field:
nl: Veld:

# tx_appointments_domain_model_address
source: Address
nl: Adres

# tx_appointments_domain_model_address.first_name
source: First Name
nl: Voornaam

# tx_appointments_domain_model_address.middle_name
source: Middle Name
nl: Tussenvoegsel

# tx_appointments_domain_model_address.last_name
source: Last Name
nl: Achternaam

# tx_appointments_domain_model_address.name
source: Name
nl: Naam

# tx_appointments_domain_model_address.gender
source: Gender
nl: Geslacht

# tx_appointments_domain_model_address.birthday
source: Birthday
nl: Geboortedag

# tx_appointments_domain_model_address.address
source: Address
nl: Adres

# tx_appointments_domain_model_address.zip
source: Zip
nl: Postcode

# tx_appointments_domain_model_address.city
source: City
nl: Plaats

# tx_appointments_domain_model_address.email
source: Emailaddress
nl: E-mailadres

# tt_address.tx_extbase_type.Tx_Appointments_Address
source: Appointment Scheduler Address
nl: Afspraken Planner Adres

# tx_appointments_domain_model_address.social_security_number
source: Social Security Number
nl: BSN

# tx_appointments_domain_model_address.creation_progress
source: Creation Progress
nl: Vordering Aanmaak

# tx_appointments_domain_model_formfieldvalue
source: Form Field Value
nl: Formulier Veld Waarde

# tx_appointments_domain_model_formfieldvalue.value
source: Value
nl: Waarde

# tx_appointments_domain_model_formfieldvalue.form_field
source: Form Field
nl: Formulier Veld
