Repository: Tuurlijk/typo3-appointments
Catalog: Resources/Private/Language/*.locallang_csh_tx_appointments_domain_model_type.xlf
Languages: nl

# name.description
source: Name of appointment type
nl: Naam van afspraak type

# superuser_only.description
source: If enabled, only lets superusers create appointments of this type
nl: Door dit te activeren, kunnen alleen superusers afspraken van dit type aanmaken

# exclusive_availability.description
source: If enabled, will make this type's availability be affected exclusively by appointments of its own type, on the same agenda
nl: Door dit te activeren, zal de beschikbaarheid van dit type uitsluitend aangetast kunnen worden door afspraken van hetzelfde type, op dezelfde agenda

# dont_block_types.description
source: If enabled, will make this type invisible to other types, on the same agenda
nl: Door dit te activeren, zal dit type onzichtbaar zijn voor andere typen, op dezelfde agenda

# dont_restrict_type_counts.description
source: If enabled, will make this type not count to other types maximum allowed appointments (per X days), on the same agenda
nl: Door dit te activeren, zal dit type niet meetellen naar de maximale toegestane afspraken van andere typen (per X dagen), op dezelfde agenda

# default_duration.description
source: Number of minutes an appointment of this type takes, at minimum
nl: Hoeveelheid minuten een afspraak van dit type minimaal in beslag neemt

# start_time_monday.description
source: Earliest possible time to make appointments on Mondays, ranging from 00:00 to 23:59
nl: Vroegst mogelijke tijdstip om afspraken te plannen op Maandagen, van 00:00 tot 23:59

# start_time_tuesday.description
source: Earliest possible time to make appointments on Tuesdays, ranging from 00:00 to 23:59
nl: Vroegst mogelijke tijdstip om afspraken te plannen op Dinsdagen, van 00:00 tot 23:59

# start_time_wednesday.description
source: Earliest possible time to make appointments on Wednesdays, ranging from 00:00 to 23:59
nl: Vroegst mogelijke tijdstip om afspraken te plannen op Woensdagen, van 00:00 tot 23:59

# start_time_thursday.description
source: Earliest possible time to make appointments on Thursdays, ranging from 00:00 to 23:59
nl: Vroegst mogelijke tijdstip om afspraken te plannen op Donderdagen, van 00:00 tot 23:59

# start_time_friday.description
source: Earliest possible time to make appointments on Fridays, ranging from 00:00 to 23:59
nl: Vroegst mogelijke tijdstip om afspraken te plannen op Vrijdagen, van 00:00 tot 23:59

# start_time_saturday.description
source: Earliest possible time to make appointments on Saturdays, ranging from 00:00 to 23:59
nl: Vroegst mogelijke tijdstip om afspraken te plannen op Zaterdagen, van 00:00 tot 23:59

# start_time_sunday.description
source: Earliest possible time to make appointments on Sundays, ranging from 00:00 to 23:59
nl: Vroegst mogelijke tijdstip om afspraken te plannen op Zondagen, van 00:00 tot 23:59

# stop_time_monday.description
source: Latest possible time to make appointments on Mondays, ranging from 00:00 to 23:59
nl: Laatst mogelijke tijdstip om afspraken te plannen op Maandagen, van 00:00 tot 23:59

# stop_time_tuesday.description
source: Latest possible time to make appointments on Tuesdays, ranging from 00:00 to 23:59
nl: Laatst mogelijke tijdstip om afspraken te plannen op Dinsdagen, van 00:00 tot 23:59

# stop_time_wednesday.description
source: Latest possible time to make appointments on Wednesdays, ranging from 00:00 to 23:59
nl: Laatst mogelijke tijdstip om afspraken te plannen op Woensdagen, van 00:00 tot 23:59

# stop_time_thursday.description
source: Latest possible time to make appointments on Thursdays, ranging from 00:00 to 23:59
nl: Laatst mogelijke tijdstip om afspraken te plannen op Donderdagen, van 00:00 tot 23:59

# stop_time_friday.description
source: Latest possible time to make appointments on Fridays, ranging from 00:00 to 23:59
nl: Laatst mogelijke tijdstip om afspraken te plannen op Vrijdagen, van 00:00 tot 23:59

# stop_time_saturday.description
source: Latest possible time to make appointments on Saturdays, ranging from 00:00 to 23:59
nl: Laatst mogelijke tijdstip om afspraken te plannen op Zaterdagen, van 00:00 tot 23:59

# stop_time_sunday.description
source: Latest possible time to make appointments on Sundays, ranging from 00:00 to 23:59
nl: Laatst mogelijke tijdstip om afspraken te plannen op Zondagen, van 00:00 tot 23:59

# exclude_holidays.description
source: If enabled, does not allow appointments on days marked as holiday in the agenda record
nl: Door dit te activeren, worden afspraken niet toegestaan op feestdagen ingesteld in de Agenda

# max_amount_monday.description
source: Number of appointments allowed on Mondays (empty = 0!)
nl: Hoeveelheid afspraken toegestaan op Maandagen (leeg = 0!)

# max_amount_tuesday.description
source: Number of appointments allowed on Tuesdays (empty = 0!)
nl: Hoeveelheid afspraken toegestaan op Dinsdagen (leeg = 0!)

# max_amount_wednesday.description
source: Number of appointments allowed on Wednesdays (empty = 0!)
nl: Hoeveelheid afspraken toegestaan op Woensdagen (leeg = 0!)

# max_amount_thursday.description
source: Number of appointments allowed on Thursdays (empty = 0!)
nl: Hoeveelheid afspraken toegestaan op Donderdagen (leeg = 0!)

# max_amount_friday.description
source: Number of appointments allowed on Fridays (empty = 0!)
nl: Hoeveelheid afspraken toegestaan op Vrijdagen (leeg = 0!)

# max_amount_saturday.description
source: Number of appointments allowed on Saturdays (empty = 0!)
nl: Hoeveelheid afspraken toegestaan op Zaterdagen (leeg = 0!)

# max_amount_sunday.description
source: Number of appointments allowed on Sundays (empty = 0!)
nl: Hoeveelheid afspraken toegestaan op Zondagen (leeg = 0!)

# minute_interval_monday.description
source: Number of minutes between allowed appointment time-slots on Mondays
nl: Hoeveelheid minuten tussen toegestane afspraak tijdssloten op Maandagen

# minute_interval_tuesday.description
source: Number of minutes between allowed appointment time-slots on Tuesdays
nl: Hoeveelheid minuten tussen toegestane afspraak tijdssloten op Dinsdagen

# minute_interval_wednesday.description
source: Number of minutes between allowed appointment time-slots on Wednesdays
nl: Hoeveelheid minuten tussen toegestane afspraak tijdssloten op Woensdagen

# minute_interval_thursday.description
source: Number of minutes between allowed appointment time-slots on Thursdays
nl: Hoeveelheid minuten tussen toegestane afspraak tijdssloten op Donderdagen

# minute_interval_friday.description
source: Number of minutes between allowed appointment time-slots on Fridays
nl: Hoeveelheid minuten tussen toegestane afspraak tijdssloten op Vrijdagen

# minute_interval_saturday.description
source: Number of minutes between allowed appointment time-slots on Saturdays
nl: Hoeveelheid minuten tussen toegestane afspraak tijdssloten op Zaterdagen

# minute_interval_sunday.description
source: Number of minutes between allowed appointment time-slots on Sundays
nl: Hoeveelheid minuten tussen toegestane afspraak tijdssloten op Zondagen

# max_amount_per_var_days.description
source: Overrules the allowed cumulative amount of appointments per X consecutive days, where the next field is X. <strong>CAUTION: Setting these inappropriately adversely affects available date/timeslots.</strong>
nl: Beheerste de toegestane hoeveelheid afspraken per X opeenvolgende dagen, waar X in het volgende veld wordt bepaald. <strong>LET OP: Het ontoepasselijk gebruik van deze velden kan de beschikbare datum/tijdsvakken negatief beïnvloeden.</strong>

# per_var_days.description
source: .. per X consecutive days .. <strong>[see previous field]</strong>
nl: .. per X opeenvolgende dagen .. <strong>[zie vorig veld]</strong>

# per_var_days_interval.description
source: If set, the number of hours before and after the cumulative amount of appointments to additionally block, if the appointments take place in consecutive timeblocks of this field's amount of hours. i.e. '12' would result in 12 hours before and after blocked if and only if the appointments take place in consecutive 12 hour blocks. <strong>CAUTION: Setting these inappropriately adversely affects performance.</strong>
nl: Indien ingevuld, het aantal uur vòòr en ná de totale hoeveelheid afspraken dat vrij moet blijven, mits de afspraken ook opeenvolgende tijdsblokken van dit aantal uur bezetten. vb. '12' zou 12 uur vòòr en ná vrijhouden, mits de afspraken plaatsvinden in opeenvolgende 12 uur tijdsblokken. <strong>LET OP: Het ontoepasselijk gebruik van deze velden kan de snelheidsprestaties schaden.</strong>

# between_minutes.description
source: Number of minutes reserved before, after and/or between appointments
nl: Hoeveelheid minuten gereserveerd voor, na en/of tussen afspraken

# hours_mutable.description
source: Number of hours an appointment can be changed/deleted after being scheduled
nl: Hoeveelheid uren waarin toegestaan een afspraak nog te wijzigen/verwijderen, nadat deze is aangemaakt

# blocked_hours.description
source: Number of hours until first available appointment time-slot
nl: Hoeveelheid uren tot de eerste toegestane afspraak tijdsslot

# blocked_hours_workdays.description
source: Number of workday hours until first available appointment time-slot, in case blocked hours fall in weekend
nl: Hoeveelheid werkdag-uren tot de eerste toegestane afspraak tijdsslot, in geval de geblokkeerde uren in het weekend vallen

# max_days_forward.description
source: Maximum number of days forward available to schedule, counting from the first
nl: Maximale hoeveelheid dagen vooruit waarin een afspraak gepland kan worden, tellend vanaf de eerst mogelijke

# form_fields.description
source: Form Fields for this appointment type
nl: Formulier Velden voor dit afspraken type
