Repository: Tuurlijk/typo3-appointments
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: nl

# tx_appointments_constants_agendaWeeksBeforeCurrent
source: Agenda Weeks Before Current: The number of weeks to display before the current
nl: Agenda Weken Voor Huidig: Het aantal weken om te tonen voor de huidige

# tx_appointments_constants_agendaWeeksAfterCurrent
source: Agenda Weeks After Current: The number of weeks to display after the current
nl: Agenda Weken Na Huidig: Het aantal weken om te tonen na de huidige

# tx_appointments_constants_freeSlotInMinutes
source: Reserve Time-slot: The number of minutes a time-slot remains reserved if the appointment is not created before this number is reached, counting from start
nl: Reserveer Tijdsslot: Het aantal minuten waarin een tijdsslot gereserveerd blijft voordat hij weer wordt vrijgegeven als de afspraak niet aangemaakt is, tellend vanaf het begin van het aanmaakproces

# tx_appointments_constants_shiftSlotPerInterval
source: Shift Time-slots Per Interval: Normally, the available timeslots shift on a daily basis at midnight, but enabling this option will shift them every X amount of minutes, where X is the relevant Appointment Type's interval
nl: Schuif Tijdssloten Per Interval: De beschikbare tijddsloten worden normaal dagelijks op middernacht verschoven, maar als u deze optie inschakelt verschuiven ze elke X aantal minuten, waar X het interval is van de relevante Afspraak Type

# tx_appointments_constants_suGroup
source: Super User Group UID
nl: Super User Groep UID

# tx_appointments_constants_redirectAfterSave
source: Redirect After Saving Appointment: Set the action to redirect to when an appointment is saved
nl: Redirect Na Opslaan Afspraak: Dit bepaalt de actie na het opslaan van een afspraak

# tx_appointments_constants_allowResume
source: Allow Resuming Appointment Creation: Enables the "unfinished"-list on the listAction, allowing to resume broken-off creation-processes
nl: Hervatten Aanmaak-Proces Toestaan: Activeert de "hervat"-lijst in de listAction, die het mogelijk maakt afgebroken aanmaak-processen te hervatten

# tx_appointments_constants_js_includeJquery
source: Enable jQuery inclusion: Will include the jQuery library through the configured CDN. If for some reason there already is a jQuery library present, you can disable appointments' here to prevent conflicts.
nl: jQuery inschakelen: Voegt het jQuery script toe aan de website vanaf het ingestelde CDN. U kunt deze uitschakelen indien al aanwezig via andere methoden.

# tx_appointments_constants_js_includeJqueryUI
source: Enable jQuery UI scripts inclusion: Will include a custom jQuery UI library for: Datepicker. You can disable it in case it is already present through other means or you're using a different datepicker in your templates.
nl: jQuery UI inschakelen: Voegt een aangepaste jQuery UI script toe voor: de Datepicker. U kunt deze uitschakelen indien al aanwezig via andere methoden, of wanneer u een andere datepicker benut in uw templates.

# tx_appointments_constants_js_includeJS
source: Enable Javascript inclusion: Will include appointments Javascript. Most is jQuery dependent, so make sure to have jQuery enabled through this extension or another way.
nl: Javascript Functionaliteit inschakelen: Toegevoegde (niet-noodzakelijke) functionaliteit welke de gebruikservaring verbetert en de Afspraken Planner gebruiksvriendelijker maakt. Het meeste is jQuery-afhankelijk.

# tx_appointments_constants_js_toFooter
source: Place Javascript in page footer: If enabled, will move the appointments Javascript out of the header and into the footer.
nl: Javascript In Pagina-Footer: Indien, will move the appointments Javascript out of the header and into the footer.

# tx_appointments_constants_js_warnOnLeave
source: Set Warning On Page-Leave: If Javascript included: adds a warning message to the new-appointment forms to warn you for losing given input, which is shown when the page is refreshed or left, giving the option to 'Leave' or 'Stay' on the page, while informing the user of possible consequences.
nl: Waarschuwing Pagina Verlaten: Indien Javascript ingeschakeld: toont een waarschuwingsbericht bij het verlaten of vernieuwen van de pagina voor het verliezen van ingevulde gegevens bij een nieuwe-afspraak formulier en geeft hierbij de keuze op de pagina te blijven of deze te 'verlaten', met nadruk op de mogelijke gevolgen.

# tx_appointments_constants_js_warnOnLeaveRespectRefreshMethod
source: Allow Auto-Refresh With WarnOnLeave: When using page.meta.REFRESH or a REFRESH header (i.e. for automatic logout purposes), warnOnLeave might prevent it. Setting this to the appropriate method will respect that method when applied if warnOnLeave is enabled.
nl: Sta Auto-Refresh Toe Bij WarnOnLeave: Wanneer uw website page.meta.REFRESH of een REFRESH header gebruikt (bijv. voor automatisch uitloggen), dan zou warnOnLeave dat kunnen voorkomen. Hier kunt u aangeven om de toegepaste methode te respecteren indien warnOnLeave is ingeschakeld.

# ts_css_frontendFile
source: Frontend CSS path: Provides frontend styling to plugin
nl: Frontend CSS pad: Verzorgt de frontend styling van de plugin.

# tx_appointments_constants_appointmentTypeList
source: Appointment Types: Comma separated list of UIDs
nl: Afspraak Typen: Komma-gescheiden lijst van UID's

# tx_appointments_flexform_appointmentTypeList
source: Appointment Types
nl: Afspraak Typen

# tx_appointments_flexform_select_all_types
source: All types (selects none)
nl: Alle typen (selecteert geen)

# tx_appointments_flexform_div_types
source: __Types:__
nl: __Typen:__

# tx_appointments_extconf_emailFrom
source: Default sending email address: overrides the default email address used for emails sent by this extension. (optional)
nl: Standaard email adres: Het standaard email adres dat gebruikt wordt bij de door deze extensie verstuurde emails. (optioneel)

# tx_appointments_extconf_emailName
source: Default email name: overrides the default name used for the sending email address. (optional)
nl: Standaard email naam: De standaard naam dat gebruikt wordt bij de door deze extensie verstuurde emails. (optioneel)

# tx_appointments_task_cleanup.name
source: Clean Up Appointment Records
nl: Opschonen Afspraak Records

# tx_appointments_task_cleanup.description
source: Marks appointment records whose creation was never completed as deleted when expired for a certain amount of time.
nl: Markeert onafgemaakte afspraak-records als verwijderd, wanneer het aantal seconden verlopen is bereikt.

# tx_appointments_task_label.age
source: Seconds Expired
nl: Seconden Verlopen

# tx_appointments_task_noAge
source: You need to supply a positive amount of seconds-expired. (e.g. 3600)
nl: U dient een positief aantal seconden-verlopen op te geven. (bijv. 3600)

# tx_appointments_flexform_sheet_sDEF
source: Settings
nl: Instellingen

# tx_appointments_flexform_switchableControllerActions
source: Agenda View
nl: Agenda Weergave

# tx_appointments_flexform_switchableControllerActions.item1
source: Month
nl: Maand

# tx_appointments_flexform_switchableControllerActions.item2
source: Weeks
nl: Weken

# tx_appointments_flexform_tsDefault
source: defined by TypoScript
nl: Gedefinieerd in TypoScript

# tx_appointments_flexform_div_userGroups
source: __User Groups:__
nl: __Gebruikersgroepen:__

# tx_appointments_flexform_suGroup
source: Superuser group
nl: Superuser groep

# tx_appointments_flexform_allowCreate
source: New Appointment Buttons
nl: Nieuwe Afspraak Knoppen

# tx_appointments_flexform_agendaNavOverride
source: Set Agenda Navigation from:
nl: Lees Agenda Navigatie uit:

# tx_appointments_flexform_agendaNavOverride.item2
source: Flexform
nl: Dit Formulier

# tx_appointments_flexform_agendaBack
source: Max Agenda Navigation Back
nl: Aantal Navigatie Eenheden Terug

# tx_appointments_flexform_agendaForward
source: Max Agenda Navigation Forward
nl: Aantal Navigatie Eenheden Vooruit

# tx_appointments_flexform_agendaWeeksBeforeCurrent
source: Number Of Weeks Before Current
nl: Aantal Weken Voor Huidig

# tx_appointments_flexform_agendaWeeksAfterCurrent
source: Number Of Weeks After Current
nl: Aantal Weken Na Huidig
