Repository: Tuurlijk/typo3-appointments
Catalog: Resources/Private/Language/*.locallang_csh_tx_appointments_domain_model_agenda.xlf
Languages: nl

# name.description
source: Name of agenda
nl: Naam van agenda

# holidays.description
source: Holiday dates in dd-mm-yyyy format, one per line
nl: Feestdagen in dd-mm-jjjj formaat, per regel één

# email_address.description
source: Emails a confirmation on every scheduled appointment to the selected addresses
nl: Emailt een bevestiging bij elk geplande afspraak naar de geselecteerde adressen

# email_text.description
source: Email body text, as it appears in the email. See details for supported variables.
nl: E-mail tekst, zoals het te zien zal zijn in de e-mail. Zie details voor ondersteunde variabelen.

# email_text.details
source: The following variables are supported: ###USER### : Name of the frontend user who owns the appointment ###AGENDA### : Name of the agenda ###TYPE### : Appointment type ###DATE### : Appointment date ###START_TIME### : Appointment start time ###END_TIME### : Appointment end time ###NOTES### : Notes ###NOTES_SU### : Superuser Notes ###ADDRESS### : Name and address information ###SECURITY### : Social Security Number ###LINK### : Link to appointment
nl: De volgende variabelen worden ondersteund: ###USER### : Naam van de frontend gebruiker die eigenaar is van de afspraak ###AGENDA### : Name van de agenda ###TYPE### : Afspraak type ###DATE### : Afspraak datum ###START_TIME### : Afspraak start tijd ###END_TIME### : Afspraak eind tijd ###NOTES### : Opmerkingen ###NOTES_SU### : Beheerders Opmerkingen ###ADDRESS### : NAW gegevens ###SECURITY### : Burger Service Nummer ###LINK### : Link naar afspraak

# calendar_invite_address.description
source: Emails a calendar invitation on every scheduled appointment to the selected addresses
nl: E-mailt een kalender uitnodiging bij elk geplande afspraak naar de geselecteerde adressen

# calendar_invite_text.description
source: Calendar invitation description, which is shown in the invitation. See detail helptext of 'Email Body Text' for supported variables.
nl: Kalender uitnodiging omschrijving, getoond in de uitnodiging. Zie de detail helptekst van 'E-mail Tekst' voor de ondersteunde variabelen.

# email_types.description
source: Determines when to send the configured confirmation email to the configured addresses
nl: Bepaalt wanneer een bevestigingsmail verstuurd moet worden naar de ingestelde adressen

# email_owner_types.description
source: Determines when to send the configured confirmation email to the frontend user
nl: Bepaalt wanneer een bevestigingsmail verstuurd moet worden naar de frontend gebruiker

# email_field_types.description
source: Determines when to send the configured confirmation email to email addresses provided by the user in "Email confirmation" fields.
nl: Bepaalt wanneer een bevestigingsmail verstuurd moet worden naar de e-mail addressen ingevuld door de gebruiker in "E-mail bevestiging" velden.

# calendar_invite_types.description
source: Determines when to send the configured calendar invitation to the configured addresses
nl: Bepaalt wanneer een kalender uitnodiging verstuurd moet worden naar de ingestelde adressen
