Repository: Tuurlijk/typo3-appointments
Catalog: Resources/Private/Language/*.locallang_csh_flexform_agenda.xlf
Languages: nl

# switchableControllerActions.description
source: Determines the view of the agenda. "Month" displays entire months, "Weeks" displays the configured amount of weeks.
nl: Bepaalt de weergave van de agenda. "Maand" toont hele maanden, "Weken" toont het ingestelde aantal weken.

# settings.agendaUid.description
source: Pick the agenda to show, or set it to depend on the associated TypoScript constant.
nl: Kies de agenda om te tonen, of laat het afhangen van de gerelateerde TypoScript constante.

# settings.agendaNavOverride.description
source: It's possible to set how far back and forward you can navigate through the agenda. You can set the plugin to listen to flexform or to TypoScript values.
nl: Het is mogelijk in te stellen hoever vooruit en terug genavigeerd kan worden in de agenda. Deze instelling bepaalt of de plugin dit uitleest uit dit formulier of uit TypoScript.

# settings.agendaBack.description
source: By setting this, you allow the user to navigate a number of units back in the agenda, allowing to view anyone's appointments from previous times.
nl: Deze instelling staat de gebruiker toe om het opgegeven aantal eenheden terug te navigeren in de agenda.

# settings.agendaForward.description
source: By setting this, you allow the user to navigate a number of units forward in the agenda, allowing to view anyone's appointments ahead.
nl: Deze instelling staat de gebruiker toe om het opgegeven aantal eenheden vooruit te navigeren in de agenda.

# settings.agendaWeeksBeforeCurrent.description
source: Allows you to set how many weeks to display before the current week, when Agenda View is set to "Weeks".
nl: Deze instelling bepaalt hoeveel weken getoond worden vòòr de huidige week, indien de Agenda Weergave op "Weken" staat.

# settings.agendaWeeksAfterCurrent.description
source: Allows you to set how many weeks to display after the current week, when Agenda View is set to "Weeks".
nl: Deze instelling bepaalt hoeveel weken getoond worden ná de huidige week, indien de Agenda Weergave op "Weken" staat.

# settings.appointmentTypeList.description
source: Limit the appointment types shown on the agenda, or set it to depend on the associated TypoScript constant.
nl: Beperk de toegestane afspraak typen die getoond worden op de agenda, of laat het afhangen van de gerelateerde TypoScript constante.

# settings.allowCreate.description
source: Adds new appointment buttons to the agenda view, or set it to depend on the associated TypoScript constant.
nl: Voegt nieuwe afspraak knoppen toe aan de Agenda Weergave, of laat het afhangen van de gerelateerde TypoScript constante.

# settings.suGroup.description
source: Members of the Superuser Group have additional permissions and rights.
nl: Leden van de Superuser Groep hebben extra rechten.
